In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sqlalchemy.ext.automap import automap_base
from config import (user, password, host, port, database)

In [2]:
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://{user}:{password}@{host}:{port}/{database}')
conn = engine.connect()

In [3]:
base = automap_base()
base.prepare(engine, reflect=True)
base.classes.keys()

['titles', 'employees', 'departments', 'salaries']

In [ ]:
#1. List the following details of each employee: employee number, last name, first name, sex, and salary.
employeespd = pd.read_sql('select employees.first_name, employees.last_name, employees.sex, salaries.salary from employees inner join salaries on employees.emp_no=salaries.emp_no', conn)
employeespd

In [ ]:
#2. List first name, last name, and hire date for employees who were hired in 1986.
employees1986 = pd.read_sql("select first_name, last_name, hire_date from employees where hire_date >= '1986-01-01 00:00:00' and hire_date < '1987-01-01 00:00:00' ", conn)
employees1986

In [ ]:
#3. List the manager of each department with the following information: department number, department name, the manager's employee number, last name, first name.
deptmanagers = pd.read_sql("select departments.dept_no, departments.dept_name, employees.emp_no, employees.first_name, employees.last_name from dept_manager inner join departments on departments.dept_no=dept_manager.dept_no inner join employees on dept_manager.emp_no = employees.emp_no", conn)
deptmanagers

In [ ]:
#4. List the department of each employee with the following information: employee number, last name, first name, and department name.
emp_depts = pd.read_sql("select employees.emp_no, employees.last_name, employees.first_name, employees.first_name, departments.dept_name from employees inner join dept_emp on employees.emp_no=dept_emp.emp_no inner join departments on dept_emp.dept_no=departments.dept_no", conn)
emp_depts

In [ ]:
#5. List first name, last name, and sex for employees whose first name is "Hercules" and last names begin with "B."
bercules = pd.read_sql("select first_name, last_name, sex from employees where first_name='Hercules' and last_name like 'B%%'", conn)
bercules

In [6]:
#6. List all employees in the Sales department, including their employee number, last name, first name, and department name.
sales_emps = pd.read_sql("select employees.emp_no, employees.last_name, employees.last_name, departments.dept_name from employees inner join dept_emp on dept_emp.emp_no=employees.emp_no inner join departments on departments.dept_no=dept_emp.dept_no where departments.dept_name like 'Sales' ",conn)
sales_emps

       emp_no    last_name    last_name dept_name
0       10002       Simmel       Simmel     Sales
1       10016  Cappelletti  Cappelletti     Sales
2       10034         Swan         Swan     Sales
3       10041       Lenart       Lenart     Sales
4       10050       Dredge       Dredge     Sales
...       ...          ...          ...       ...
52240  499899        Usdin        Usdin     Sales
52241  499901     Terekhov     Terekhov     Sales
52242  499902     Wuwongse     Wuwongse     Sales
52243  499919     Angiulli     Angiulli     Sales
52244  499920      Murtagh      Murtagh     Sales

[52245 rows x 4 columns]

In [7]:
#7. List all employees in the Sales and Development departments, including their employee number, last name, first name, and department name.
salesndev_emps = pd.read_sql("select employees.emp_no, employees.last_name, employees.last_name, departments.dept_name from employees inner join dept_emp on dept_emp.emp_no=employees.emp_no inner join departments on departments.dept_no=dept_emp.dept_no where departments.dept_name like 'Sales' or departments.dept_name like 'Development' ",conn)
salesndev_emps

        emp_no  last_name  last_name    dept_name
0        10001    Facello    Facello  Development
1        10002     Simmel     Simmel        Sales
2        10006    Preusig    Preusig  Development
3        10008   Kalloufi   Kalloufi  Development
4        10012  Bridgland  Bridgland  Development
...        ...        ...        ...          ...
137947  499911   Tagansky   Tagansky  Development
137948  499914    Keirsey    Keirsey  Development
137949  499919   Angiulli   Angiulli        Sales
137950  499920    Murtagh    Murtagh        Sales
137951  499924       Swan       Swan  Development

[137952 rows x 4 columns]

In [13]:
#8. In descending order, list the frequency count of employee last names, i.e., how many employees share each last name.
lastnamecount = pd.read_sql('select last_name, COUNT(*) from employees group by last_name order by count desc', conn)
lastnamecount

       last_name  count
0           Baba    226
1         Gelosh    223
2          Coorg    223
3        Sudbeck    222
4         Farris    222
...          ...    ...
1633  Guardalben    148
1634        Zykh    148
1635       Merro    147
1636    Sadowsky    145
1637    Foolsday      1

[1638 rows x 2 columns]